'''
3. Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка.
В его конструкторе инициализировать параметр, соответствующий количеству клеток (целое число).
В классе должны быть реализованы методы перегрузки арифметических операторов:
сложение (__add__()), вычитание (__sub__()), умножение (__mul__()), деление (__truediv__()).
Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение, умножение и
обычное (не целочисленное) деление клеток, соответственно.
В методе деления должно осуществляться округление значения до целого числа.

Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.

Вычитание. Участвуют две клетки. Операцию необходимо выполнять только
если разность количества ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.

Умножение. Создается общая клетка из двух.
Число ячеек общей клетки определяется как произведение количества ячеек этих двух клеток.

Деление. Создается общая клетка из двух.
Число ячеек общей клетки определяется как целочисленное деление количества ячеек этих двух клеток.

В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
Данный метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.

Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5.
Тогда метод make_order() вернет строку: *****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5.
Тогда метод make_order() вернет строку: *****\n*****\n*****.
'''


class Cell:
    def __init__(self, value):
        if not isinstance(value, int):
            raise ValueError("Ошибка: число ячеек клетки должно быть целым числом.")
        if value < 0:
            raise ValueError("Ошибка: число ячеек клетки должно быть неотрицательным числом.")
        self.value = value

    def __add__(self, other_cell):
        if not isinstance(other_cell, Cell):
            raise ValueError("Ошибка: к клетке прибавляется не клетка.")
        return Cell(self.value + other_cell.value)

    def __sub__(self, other_cell):
        if not isinstance(other_cell, Cell):
            raise ValueError("Ошибка: из клетки вычиталась не клетка.")
        if self.value >= other_cell.value:
            return Cell(self.value - other_cell.value)
        else:
            raise ValueError("Ошибка: из клетки с меньшим числом ячеек вычиталась клетка с большим.")

    def __mul__(self, other_cell):
        if not isinstance(other_cell, Cell):
            raise ValueError("Ошибка: клетка умножалась не на клетку.")
        return Cell(self.value * other_cell.value)

    def __truediv__(self, other_cell):
        if not isinstance(other_cell, Cell):
            raise ValueError("Ошибка: клетка делилась не на клетку.")
        return Cell(round(self.value / other_cell.value))

    def make_order(self, number):
        return '\n'.join(['*'*number for _ in range(self.value // number)] + ['*'*(self.value % number)])

a = Cell(5)
print(f"Клетка a со значением {a.value}, ячеек в ряду 3")
print(a.make_order(3) + '\n')

b = Cell(3)
print(f"Клетка b со значением {b.value}, ячеек в ряду 4")
print(b.make_order(4)+ '\n')

c = a+b
print(f"Клетка a + b со значением {c.value}, ячеек в ряду 2")
print(c.make_order(2) + '\n')

c = a-b
print(f"Клетка a - b со значением {c.value}, ячеек в ряду 5")
print(c.make_order(5) + '\n')

c = a*b
print(f"Клетка a * b со значением {c.value}, ячеек в ряду 7")
print(c.make_order(7) + '\n')

c = a/b
print(f"Клетка a / b со значением {c.value}, ячеек в ряду 1")
print(c.make_order(1) + '\n')